GreatCowBASIC/DATFileGenerator/incfiles/p18lf55k42.inc
T0CON1           EQU  H'3FB9'
LATA             EQU  H'3FBA'
LATB             EQU  H'3FBB'
LATC             EQU  H'3FBC'
LATD             EQU  H'3FBD'
LATE             EQU  H'3FBE'
LATF             EQU  H'3FBF'
TRISA            EQU  H'3FC2'
TRISB            EQU  H'3FC3'
TRISC            EQU  H'3FC4'
TRISD            EQU  H'3FC5'
TRISE            EQU  H'3FC6'
TRISF            EQU  H'3FC7'
PORTA            EQU  H'3FCA'
PORTB            EQU  H'3FCB'
PORTC            EQU  H'3FCC'
PORTD            EQU  H'3FCD'
PORTE            EQU  H'3FCE'
PORTF            EQU  H'3FCF'
INTCON0          EQU  H'3FD2'
INTCON1          EQU  H'3FD3'
IVTLOCK          EQU  H'3FD4'
IVTBASE          EQU  H'3FD5'
IVTBASEL         EQU  H'3FD5'
IVTBASEH         EQU  H'3FD6'
IVTBASEU         EQU  H'3FD7'
STATUS           EQU  H'3FD8'
FSR2L            EQU  H'3FD9'
FSR2H            EQU  H'3FDA'
PLUSW2           EQU  H'3FDB'
PREINC2          EQU  H'3FDC'
POSTDEC2         EQU  H'3FDD'
POSTINC2         EQU  H'3FDE'
INDF2            EQU  H'3FDF'
BSR              EQU  H'3FE0'
FSR1L            EQU  H'3FE1'
FSR1H            EQU  H'3FE2'
PLUSW1           EQU  H'3FE3'
PREINC1          EQU  H'3FE4'
POSTDEC1         EQU  H'3FE5'
POSTINC1         EQU  H'3FE6'
INDF1            EQU  H'3FE7'
WREG             EQU  H'3FE8'
FSR0L            EQU  H'3FE9'
FSR0H            EQU  H'3FEA'
PLUSW0           EQU  H'3FEB'
PREINC0          EQU  H'3FEC'
POSTDEC0         EQU  H'3FED'
POSTINC0         EQU  H'3FEE'
INDF0            EQU  H'3FEF'
PCON0            EQU  H'3FF0'
PCON1            EQU  H'3FF1'
PROD             EQU  H'3FF3'
PRODL            EQU  H'3FF3'
PRODH            EQU  H'3FF4'
TABLAT           EQU  H'3FF5'
TBLPTR           EQU  H'3FF6'
TBLPTRL          EQU  H'3FF6'
TBLPTRH          EQU  H'3FF7'
TBLPTRU          EQU  H'3FF8'
PC               EQU  H'3FF9'
PCL              EQU  H'3FF9'
PCLATH           EQU  H'3FFA'
PCLATU           EQU  H'3FFB'
STKPTR           EQU  H'3FFC'
TOS              EQU  H'3FFD'
TOSL             EQU  H'3FFD'
TOSH             EQU  H'3FFE'
TOSU             EQU  H'3FFF'

;----- IPR1 Bits -----------------------------------------------------
INT0IP           EQU  H'0000'
ZCDIP            EQU  H'0001'
ADIP             EQU  H'0002'
ADTIP            EQU  H'0003'
C1IP             EQU  H'0004'
SMT1IP           EQU  H'0005'
SMT1PRAIP        EQU  H'0006'
SMT1PWAIP        EQU  H'0007'


;----- PIE1 Bits -----------------------------------------------------
INT0IE           EQU  H'0000'
ZCDIE            EQU  H'0001'
ADIE             EQU  H'0002'
ADTIE            EQU  H'0003'
C1IE             EQU  H'0004'
SMT1IE           EQU  H'0005'
SMT1PRAIE        EQU  H'0006'
SMT1PWAIE        EQU  H'0007'


;----- PIR1 Bits -----------------------------------------------------
INT0IF           EQU  H'0000'
ZCDIF            EQU  H'0001'
ADIF             EQU  H'0002'
ADTIF            EQU  H'0003'
C1IF             EQU  H'0004'
SMT1IF           EQU  H'0005'
SMT1PRAIF        EQU  H'0006'
SMT1PWAIF        EQU  H'0007'


;----- PMD1 Bits -----------------------------------------------------
TMR0MD           EQU  H'0000'
TMR1MD           EQU  H'0001'
TMR2MD           EQU  H'0002'
TMR3MD           EQU  H'0003'
TMR4MD           EQU  H'0004'
TMR5MD           EQU  H'0005'
TMR6MD           EQU  H'0006'
NCO1MD           EQU  H'0007'


;----- OSCCON1 Bits -----------------------------------------------------
NDIV0            EQU  H'0000'
NDIV1            EQU  H'0001'
NDIV2            EQU  H'0002'
NDIV3            EQU  H'0003'
NOSC0            EQU  H'0004'
NOSC1            EQU  H'0005'
NOSC2            EQU  H'0006'


;----- DMA1PR Bits -----------------------------------------------------
;PR0              EQU  H'0000'
PR1              EQU  H'0001'
;PR2              EQU  H'0002'


DMA1PR0          EQU  H'0000'
DMA1PR1          EQU  H'0001'
DMA1PR2          EQU  H'0002'


;----- RA1PPS Bits -----------------------------------------------------
RA1PPS0          EQU  H'0000'
RA1PPS1          EQU  H'0001'
RA1PPS2          EQU  H'0002'
RA1PPS3          EQU  H'0003'
RA1PPS4          EQU  H'0004'
RA1PPS5          EQU  H'0005'


;----- RB1PPS Bits -----------------------------------------------------
RB1PPS0          EQU  H'0000'
RB1PPS1          EQU  H'0001'
RB1PPS2          EQU  H'0002'
RB1PPS3          EQU  H'0003'
RB1PPS4          EQU  H'0004'
RB1PPS5          EQU  H'0005'


;----- RC1PPS Bits -----------------------------------------------------
RC1PPS0          EQU  H'0000'
RC1PPS1          EQU  H'0001'
RC1PPS2          EQU  H'0002'
RC1PPS3          EQU  H'0003'
RC1PPS4          EQU  H'0004'
RC1PPS5          EQU  H'0005'


;----- RD1PPS Bits -----------------------------------------------------
RD1PPS0          EQU  H'0000'
RD1PPS1          EQU  H'0001'
RD1PPS2          EQU  H'0002'
RD1PPS3          EQU  H'0003'
RD1PPS4          EQU  H'0004'
RD1PPS5          EQU  H'0005'


;----- RE1PPS Bits -----------------------------------------------------
RE1PPS0          EQU  H'0000'
RE1PPS1          EQU  H'0001'
RE1PPS2          EQU  H'0002'
RE1PPS3          EQU  H'0003'
RE1PPS4          EQU  H'0004'
RE1PPS5          EQU  H'0005'


;----- RF1PPS Bits -----------------------------------------------------
RF1PPS0          EQU  H'0000'
RF1PPS1          EQU  H'0001'
RF1PPS2          EQU  H'0002'
RF1PPS3          EQU  H'0003'
RF1PPS4          EQU  H'0004'
RF1PPS5          EQU  H'0005'


;----- RB1I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'

TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'

I2CSLEW          EQU  H'0006'

I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'


;----- DMA1BUF Bits -----------------------------------------------------
BUF0             EQU  H'0000'
BUF1             EQU  H'0001'
BUF2             EQU  H'0002'
BUF3             EQU  H'0003'
BUF4             EQU  H'0004'
BUF5             EQU  H'0005'
BUF6             EQU  H'0006'
BUF7             EQU  H'0007'


DMA1BUF0         EQU  H'0000'
DMA1BUF1         EQU  H'0001'
DMA1BUF2         EQU  H'0002'
DMA1BUF3         EQU  H'0003'
DMA1BUF4         EQU  H'0004'
DMA1BUF5         EQU  H'0005'
DMA1BUF6         EQU  H'0006'
DMA1BUF7         EQU  H'0007'


