GreatCowBASIC/DATFileGenerator/incfiles/p18lf55k42.inc
;----- INLVLD Bits -----------------------------------------------------
INLVLD0          EQU  H'0000'
INLVLD1          EQU  H'0001'
INLVLD2          EQU  H'0002'
INLVLD3          EQU  H'0003'
INLVLD4          EQU  H'0004'
INLVLD5          EQU  H'0005'
INLVLD6          EQU  H'0006'
INLVLD7          EQU  H'0007'


;----- CCDPD Bits -----------------------------------------------------
CCDPD0           EQU  H'0000'
CCDPD1           EQU  H'0001'
CCDPD2           EQU  H'0002'
CCDPD3           EQU  H'0003'
CCDPD4           EQU  H'0004'
CCDPD5           EQU  H'0005'
CCDPD6           EQU  H'0006'
CCDPD7           EQU  H'0007'


;----- CCDND Bits -----------------------------------------------------
CCDND0           EQU  H'0000'
CCDND1           EQU  H'0001'
CCDND2           EQU  H'0002'
CCDND3           EQU  H'0003'
CCDND4           EQU  H'0004'
CCDND5           EQU  H'0005'
CCDND6           EQU  H'0006'
CCDND7           EQU  H'0007'


;----- RD0I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'

TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'

I2CSLEW          EQU  H'0006'

I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'


;----- RD1I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'

TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'

I2CSLEW          EQU  H'0006'

I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'


;----- ANSELE Bits -----------------------------------------------------
ANSELE0          EQU  H'0000'
ANSELE1          EQU  H'0001'
ANSELE2          EQU  H'0002'


;----- WPUE Bits -----------------------------------------------------
WPUE0            EQU  H'0000'
WPUE1            EQU  H'0001'
WPUE2            EQU  H'0002'
WPUE3            EQU  H'0003'


;----- ODCONE Bits -----------------------------------------------------
ODCE0            EQU  H'0000'
ODCE1            EQU  H'0001'
ODCE2            EQU  H'0002'


;----- SLRCONE Bits -----------------------------------------------------
SLRE0            EQU  H'0000'
SLRE1            EQU  H'0001'
SLRE2            EQU  H'0002'


;----- INLVLE Bits -----------------------------------------------------
INLVLE0          EQU  H'0000'
INLVLE1          EQU  H'0001'
INLVLE2          EQU  H'0002'
INLVLE3          EQU  H'0003'


;----- IOCEP Bits -----------------------------------------------------
IOCEP3           EQU  H'0003'


;----- IOCEN Bits -----------------------------------------------------
IOCEN3           EQU  H'0003'


;----- IOCEF Bits -----------------------------------------------------
IOCEF3           EQU  H'0003'


;----- CCDPE Bits -----------------------------------------------------
CCDPE0           EQU  H'0000'
CCDPE1           EQU  H'0001'
CCDPE2           EQU  H'0002'


;----- CCDNE Bits -----------------------------------------------------
CCDNE0           EQU  H'0000'
CCDNE1           EQU  H'0001'
CCDNE2           EQU  H'0002'


;----- ANSELF Bits -----------------------------------------------------
ANSELF0          EQU  H'0000'
ANSELF1          EQU  H'0001'
ANSELF2          EQU  H'0002'
ANSELF3          EQU  H'0003'
ANSELF4          EQU  H'0004'
ANSELF5          EQU  H'0005'
ANSELF6          EQU  H'0006'
ANSELF7          EQU  H'0007'


;----- WPUF Bits -----------------------------------------------------
WPUF0            EQU  H'0000'
WPUF1            EQU  H'0001'
WPUF2            EQU  H'0002'
WPUF3            EQU  H'0003'
WPUF4            EQU  H'0004'
WPUF5            EQU  H'0005'
WPUF6            EQU  H'0006'
WPUF7            EQU  H'0007'


;----- ODCONF Bits -----------------------------------------------------
ODCF0            EQU  H'0000'
ODCF1            EQU  H'0001'
ODCF2            EQU  H'0002'
ODCF3            EQU  H'0003'
ODCF4            EQU  H'0004'
ODCF5            EQU  H'0005'
ODCF6            EQU  H'0006'
ODCF7            EQU  H'0007'


;----- SLRCONF Bits -----------------------------------------------------
SLRF0            EQU  H'0000'
SLRF1            EQU  H'0001'
SLRF2            EQU  H'0002'
SLRF3            EQU  H'0003'
SLRF4            EQU  H'0004'
SLRF5            EQU  H'0005'
SLRF6            EQU  H'0006'
SLRF7            EQU  H'0007'


;----- INLVLF Bits -----------------------------------------------------
INLVLF0          EQU  H'0000'
INLVLF1          EQU  H'0001'
INLVLF2          EQU  H'0002'
INLVLF3          EQU  H'0003'
INLVLF4          EQU  H'0004'
INLVLF5          EQU  H'0005'
INLVLF6          EQU  H'0006'
INLVLF7          EQU  H'0007'


;----- CCDPF Bits -----------------------------------------------------
CCDPF0           EQU  H'0000'
CCDPF1           EQU  H'0001'
CCDPF2           EQU  H'0002'
CCDPF3           EQU  H'0003'
CCDPF4           EQU  H'0004'
CCDPF5           EQU  H'0005'
CCDPF6           EQU  H'0006'
CCDPF7           EQU  H'0007'


;----- CCDNF Bits -----------------------------------------------------
CCDNF0           EQU  H'0000'
CCDNF1           EQU  H'0001'
CCDNF2           EQU  H'0002'
CCDNF3           EQU  H'0003'
CCDNF4           EQU  H'0004'
CCDNF5           EQU  H'0005'
CCDNF6           EQU  H'0006'
CCDNF7           EQU  H'0007'


;----- CCDCON Bits -----------------------------------------------------
EN               EQU  H'0007'

CCDEN            EQU  H'0007'

SEL0             EQU  H'0000'
SEL1             EQU  H'0001'


;----- PPSLOCK Bits -----------------------------------------------------
PPSLOCKED        EQU  H'0000'


;----- DMA2BUF Bits -----------------------------------------------------
BUF0             EQU  H'0000'
BUF1             EQU  H'0001'
BUF2             EQU  H'0002'
BUF3             EQU  H'0003'
BUF4             EQU  H'0004'
BUF5             EQU  H'0005'
BUF6             EQU  H'0006'
BUF7             EQU  H'0007'


DMA2BUF0         EQU  H'0000'
DMA2BUF1         EQU  H'0001'
DMA2BUF2         EQU  H'0002'
DMA2BUF3         EQU  H'0003'
DMA2BUF4         EQU  H'0004'
DMA2BUF5         EQU  H'0005'
DMA2BUF6         EQU  H'0006'
DMA2BUF7         EQU  H'0007'


;----- DMA2DCNTL Bits -----------------------------------------------------
DCNT0            EQU  H'0000'
DCNT1            EQU  H'0001'
DCNT2            EQU  H'0002'
DCNT3            EQU  H'0003'
DCNT4            EQU  H'0004'
DCNT5            EQU  H'0005'
DCNT6            EQU  H'0006'
DCNT7            EQU  H'0007'


DMA2DCNT0        EQU  H'0000'
DMA2DCNT1        EQU  H'0001'
DMA2DCNT2        EQU  H'0002'
DMA2DCNT3        EQU  H'0003'
DMA2DCNT4        EQU  H'0004'
DMA2DCNT5        EQU  H'0005'
DMA2DCNT6        EQU  H'0006'
DMA2DCNT7        EQU  H'0007'


;----- DMA2DCNTH Bits -----------------------------------------------------
DCNT8            EQU  H'0000'
DCNT9            EQU  H'0001'
DCNT10           EQU  H'0002'
DCNT11           EQU  H'0003'


DMA2DCNT8        EQU  H'0000'
DMA2DCNT9        EQU  H'0001'
DMA2DCNT10       EQU  H'0002'
DMA2DCNT11       EQU  H'0003'


;----- DMA2DPTRL Bits -----------------------------------------------------
DPTR0            EQU  H'0000'
DPTR1            EQU  H'0001'
DPTR2            EQU  H'0002'
DPTR3            EQU  H'0003'
DPTR4            EQU  H'0004'
DPTR5            EQU  H'0005'
DPTR6            EQU  H'0006'
DPTR7            EQU  H'0007'


DMA2DPTR0        EQU  H'0000'
DMA2DPTR1        EQU  H'0001'
DMA2DPTR2        EQU  H'0002'
DMA2DPTR3        EQU  H'0003'
DMA2DPTR4        EQU  H'0004'
DMA2DPTR5        EQU  H'0005'
DMA2DPTR6        EQU  H'0006'
DMA2DPTR7        EQU  H'0007'


